stevenj/avr-libc3/include/avr/io/attiny13a.h
/* Store program Memory Enable */
typedef enum CPU_SPMEN_enum
{
    CPU_SPMEN_CLEAR_gc = (0x00), /* Store program Memory Enable - CLEAR */
    CPU_SPMEN_SET_gc   = (0x01), /* Store program Memory Enable - SET */
} CPU_SPMEN_t;

/* Power Reduction Timer/Counter0 */
typedef enum CPU_PRTIM0_enum
{
    CPU_PRTIM0_CLEAR_gc = (0x00), /* Power Reduction Timer/Counter0 - CLEAR */
    CPU_PRTIM0_SET_gc   = (0x02), /* Power Reduction Timer/Counter0 - SET */
} CPU_PRTIM0_t;

/* Power Reduction ADC */
typedef enum CPU_PRADC_enum
{
    CPU_PRADC_CLEAR_gc = (0x00), /* Power Reduction ADC - CLEAR */
    CPU_PRADC_SET_gc   = (0x01), /* Power Reduction ADC - SET */
} CPU_PRADC_t;

/* BOD Power-Down in Power-Down Sleep */
typedef enum CPU_BODS_enum
{
    CPU_BODS_CLEAR_gc = (0x00), /* BOD Power-Down in Power-Down Sleep - CLEAR */
    CPU_BODS_SET_gc   = (0x02), /* BOD Power-Down in Power-Down Sleep - SET */
} CPU_BODS_t;

/* BOD Power-Down Sleep Enable */
typedef enum CPU_BODSE_enum
{
    CPU_BODSE_CLEAR_gc = (0x00), /* BOD Power-Down Sleep Enable - CLEAR */
    CPU_BODSE_SET_gc   = (0x01), /* BOD Power-Down Sleep Enable - SET */
} CPU_BODSE_t;
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define ADC     (*(ADC_t *) 0x0000)     /* Analog-to-Digital Converter */
#define AC      (*(AC_t *) 0x0000)      /* Analog Comparator */
#define EEPROM  (*(EEPROM_t *) 0x0000)  /* EEPROM */
#define CPU     (*(CPU_t *) 0x0000)     /* CPU Registers */
#define PORTB   (*(PORTB_t *) 0x0000)   /* I/O Port */
#define EXINT   (*(EXINT_t *) 0x0000)   /* External Interrupts */
#define TC0     (*(TC0_t *) 0x0000)     /* Timer/Counter, 8-bit */
#define WDT     (*(WDT_t *) 0x0000)     /* Watchdog Timer */
#define FUSE    (*(FUSE_t *) 0x0000)    /* Fuses */
#define LOCKBIT (*(LOCKBIT_t *) 0x0000) /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/


/* Self Programming enable */
#define FUSE_SELFPRGEN_CLEAR_gc (0x00) /* Self Programming enable - CLEAR */
#define FUSE_SELFPRGEN_SET_gc   (0x10) /* Self Programming enable - SET */


/* Debug Wire enable */
#define FUSE_DWEN_CLEAR_gc (0x00) /* Debug Wire enable - CLEAR */
#define FUSE_DWEN_SET_gc   (0x08) /* Debug Wire enable - SET */


/* Enable BOD and select level */
#define FUSE_BODLEVEL_4V3_gc      (0x00<<1) /* Brown-out detection at VCC=4.3 V */
#define FUSE_BODLEVEL_2V7_gc      (0x01<<1) /* Brown-out detection at VCC=2.7 V */
#define FUSE_BODLEVEL_1V8_gc      (0x02<<1) /* Brown-out detection at VCC=1.8 V */
#define FUSE_BODLEVEL_DISABLED_gc (0x03<<1) /* Brown-out detection disabled */


/* Reset Disabled (Enable PB5 as i/o pin) */
#define FUSE_RSTDISBL_CLEAR_gc (0x00) /* Reset Disabled (Enable PB5 as i/o pin) - CLEAR */
#define FUSE_RSTDISBL_SET_gc   (0x01) /* Reset Disabled (Enable PB5 as i/o pin) - SET */


/* Serial program downloading (SPI) enabled */
#define FUSE_SPIEN_CLEAR_gc (0x00) /* Serial program downloading (SPI) enabled - CLEAR */
#define FUSE_SPIEN_SET_gc   (0x80) /* Serial program downloading (SPI) enabled - SET */


/* Preserve EEPROM through the Chip Erase cycle */
#define FUSE_EESAVE_CLEAR_gc (0x00) /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
#define FUSE_EESAVE_SET_gc   (0x40) /* Preserve EEPROM through the Chip Erase cycle - SET */


/* Watch-dog Timer always on */
#define FUSE_WDTON_CLEAR_gc (0x00) /* Watch-dog Timer always on - CLEAR */
#define FUSE_WDTON_SET_gc   (0x20) /* Watch-dog Timer always on - SET */


/* Divide clock by 8 internally */
#define FUSE_CKDIV8_CLEAR_gc (0x00) /* Divide clock by 8 internally - CLEAR */
#define FUSE_CKDIV8_SET_gc   (0x10) /* Divide clock by 8 internally - SET */


/* Select Clock Source */
#define FUSE_SUT_CKSEL_EXTCLK_14CK_0MS_gc           (0x00) /* Ext. Clock; Start-up time: 14 CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTCLK_14CK_4MS_gc           (0x04) /* Ext. Clock; Start-up time: 14 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTCLK_14CK_64MS_gc          (0x08) /* Ext. Clock; Start-up time: 14 CK + 64 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ8_14CK_0MS_gc   (0x01) /* Int. RC Osc. 4.8 MHz; Start-up time: 14 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ8_14CK_4MS_gc   (0x05) /* Int. RC Osc. 4.8 MHz; Start-up time: 14 CK + 4 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ8_14CK_64MS_gc  (0x09) /* Int. RC Osc. 4.8 MHz; Start-up time: 14 CK + 64 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_9MHZ6_14CK_0MS_gc   (0x02) /* Int. RC Osc. 9.6 MHz; Start-up time: 14 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_9MHZ6_14CK_4MS_gc   (0x06) /* Int. RC Osc. 9.6 MHz; Start-up time: 14 CK + 4 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_9MHZ6_14CK_64MS_gc  (0x0A) /* Int. RC Osc. 9.6 MHz; Start-up time: 14 CK + 64 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_0MS_gc  (0x03) /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_4MS_gc  (0x07) /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 4 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_128KHZ_14CK_64MS_gc (0x0B) /* Int. RC Osc. 128 kHz; Start-up time: 14 CK + 64 ms */


/*
--------------------------------------------------------------------------------
LOCKBIT - Lockbits
--------------------------------------------------------------------------------
*/


/* Memory Lock */
#define LOCKBIT_LB_PROG_VER_DISABLED_gc (0x00) /* Further programming and verification disabled */
#define LOCKBIT_LB_PROG_DISABLED_gc     (0x02) /* Further programming disabled */
#define LOCKBIT_LB_NO_LOCK_gc           (0x03) /* No memory lock features enabled */


/*
--------------------------------------------------------------------------------
ADC - Analog-to-Digital Converter
--------------------------------------------------------------------------------
*/


/* Reference Selection Bit 0 */
#define ADC_REFS0_CLEAR_gc (0x00) /* Reference Selection Bit 0 - CLEAR */
#define ADC_REFS0_SET_gc   (0x40) /* Reference Selection Bit 0 - SET */


