stevenj/avr-libc3/include/avr/io/attiny13a.h
/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_PRR         _SFR_MEM8 (0x0045) /* Power Reduction Register */
#define CPU_CLKPR       _SFR_MEM8 (0x0046) /* Clock Prescale Register */
#define CPU_DWDR        _SFR_MEM8 (0x004E) /* Debug Wire Data Register */
#define CPU_BODCR       _SFR_MEM8 (0x0050) /* BOD Control Register */
#define CPU_OSCCAL      _SFR_MEM8 (0x0051) /* Oscillator Calibration Register */
#define CPU_MCUSR       _SFR_MEM8 (0x0054) /* MCU Status register */
#define CPU_MCUCR       _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SPMCSR      _SFR_MEM8 (0x0057) /* Store Program Memory Control and Status Register */
#define CPU_SPL         _SFR_MEM8 (0x005D) /* Stack Pointer Low Byte */
#define CPU_SREG        _SFR_MEM8 (0x005F) /* Status Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0036) /* Input Pins, Port B */
#define PORTBB_DDRB     _SFR_MEM8 (0x0037) /* Data Direction Register, Port B */
#define PORTBB_PORTB    _SFR_MEM8 (0x0038) /* Data Register, Port B */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK     _SFR_MEM8 (0x0035) /* Pin Change Enable Mask */
#define EXINT_MCUCR     _SFR_MEM8 (0x0055) /* MCU Control Register */
#define EXINT_GIFR      _SFR_MEM8 (0x005A) /* General Interrupt Flag register */
#define EXINT_GIMSK     _SFR_MEM8 (0x005B) /* General Interrupt Mask Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE        _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_GTCCR       _SFR_MEM8 (0x0048) /* General Timer Conuter Register */
#define TC8_OCR0B       _SFR_MEM8 (0x0049) /* Timer/Counter0 Output Compare Register */
#define TC8_TCCR0A      _SFR_MEM8 (0x004F) /* Timer/Counter  Control Register A */
#define TC8_TCNT0       _SFR_MEM8 (0x0052) /* Timer/Counter0 */
#define TC8_TCCR0B      _SFR_MEM8 (0x0053) /* Timer/Counter Control Register B */
#define TC8_OCR0A       _SFR_MEM8 (0x0056) /* Timer/Counter0 Output Compare Register */
#define TC8_TIFR0       _SFR_MEM8 (0x0058) /* Timer/Counter0 Interrupt Flag register */
#define TC8_TIMSK0      _SFR_MEM8 (0x0059) /* Timer/Counter0 Interrupt Mask Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCR       _SFR_MEM8 (0x0041) /* Watchdog Timer Control Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW        _SFR_MEM8 (0x0000) 
#define FUSE_HIGH       _SFR_MEM8 (0x0001) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num      (0)                 
#define None_RESET_vect          _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num       (1)                 
#define None_INT0_vect           _VECTOR(1)          /* External Interrupt 0 */
#define None_PCINT0_vect_num     (2)                 
#define None_PCINT0_vect         _VECTOR(2)          /* External Interrupt Request 0 */
#define None_TIM0_OVF_vect_num   (3)                 
#define None_TIM0_OVF_vect       _VECTOR(3)          /* Timer/Counter0 Overflow */
#define None_EE_RDY_vect_num     (4)                 
#define None_EE_RDY_vect         _VECTOR(4)          /* EEPROM Ready */
#define None_ANA_COMP_vect_num   (5)                 
#define None_ANA_COMP_vect       _VECTOR(5)          /* Analog Comparator */
#define None_TIM0_COMPA_vect_num (6)                 
#define None_TIM0_COMPA_vect     _VECTOR(6)          /* Timer/Counter Compare Match A */
#define None_TIM0_COMPB_vect_num (7)                 
#define None_TIM0_COMPB_vect     _VECTOR(7)          /* Timer/Counter Compare Match B */
#define None_WDT_vect_num        (8)                 
#define None_WDT_vect            _VECTOR(8)          /* Watchdog Time-out */
#define None_ADC_vect_num        (9)                 
#define None_ADC_vect            _VECTOR(9)          /* ADC Conversion Complete */

/* Vector Table Size */
#define _VECTOR_SIZE             (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE            (10 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x0400)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

#define FLASH_START     (0x0000)                           
#define FLASH_SIZE      (0x0400)                           
#define FLASH_PAGE_SIZE (0x0020)                           
#define FLASH_END       (FLASH_START + FLASH_SIZE - 1)     

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0002)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

